MMmm

In [1]:
import os 
print(os.getcwd())

import pandas as pd
df=pd.read_csv('TEST.csv', delimiter=';')
df
import

/Users/cheerchung/Google drive/TechnicalLearning/Python/Jupyter

ModuleNotFoundError: No module named 'pandas'

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Chandler to Phebe
Data columns (total 3 columns):
serial num    5 non-null int64
first name    5 non-null object
age           5 non-null int64
dtypes: int64(2), object(1)
memory usage: 320.0+ bytes

In [95]:
df['Monica':'Monica']

           serial num first name  age
last name
Monica             22     GELLER  122

In [84]:
df.loc[df.age>122]

           serial num first name  age
last name
Racheal            33      GREEN  133
Phebe              44    BOUFFET  123

In [85]:
df.all()

serial num    True
first name    True
age           True
dtype: bool

In [101]:
df

           serial num first name  age
last name
Chandler            2       BING  122
Monica             22     GELLER  122
Racheal            33      GREEN    0
Phebe              44    BOUFFET  123

In [4]:
df=df.set_index(['first name','age'])

In [5]:
df

                serial num last name
first name age
BING       122           2  Chandler
GELLER     122          22    Monica
GREEN      0            33   Racheal
BOUFFET    123          44     Phebe
           124          22     Phebe

In [55]:
df=df.sort_index(level=0)
print(df)

                serial num last name
first name age
BING       122           2  Chandler
BOUFFET    123          44     Phebe
           124          22     Phebe
GELLER     122          22    Monica
GREEN      0            33   Racheal

In [11]:
df=df.sort_index(level=1)
print(df)

                serial num last name
first name age
GREEN      0            33   Racheal
BING       122           2  Chandler
GELLER     122          22    Monica
BOUFFET    123          44     Phebe
           124          22     Phebe

In [16]:
df.loc[slice(None),['serial num','last name']]=df.loc[slice(None),['last name','serial num']]
df

                serial num last name
first name age
GREEN      0            33   Racheal
BING       122           2  Chandler
GELLER     122          22    Monica
BOUFFET    123          44     Phebe
           124          22     Phebe

In [117]:
df2=pd.DataFrame({'index':[0,1,2],'index2':[3,4,5]})

In [118]:
df2.all()

index     False
index2     True
dtype: bool

In [3]:
import numpy as np
import pandas as pd
data = pd.Series([1,np.nan,3,np.nan,5])

In [4]:
data

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64

In [5]:
data.fillna(0)

0    1.0
1    0.0
2    3.0
3    0.0
4    5.0
dtype: float64

In [12]:
d2=data.fillna(method='bfill')

In [14]:
d2.transform(lambda x: x/10)

0    0.1
1    0.3
2    0.3
3    0.5
4    0.5
dtype: float64

In [15]:
d2.apply(lambda x: x/5)

0    0.2
1    0.6
2    0.6
3    1.0
4    1.0
dtype: float64

In [23]:
df2=pd.DataFrame({'content':['a','b','c',1,2,3],'type':['lettre','lettre','lettre','num','num','num']})

In [24]:
df2

  content    type
0       a  lettre
1       b  lettre
2       c  lettre
3       1     num
4       2     num
5       3     num

In [39]:
dddff=df2.groupby('type')

In [40]:
dddff

In [44]:
ps=pd.Series(['red','blue','red'],index=range(3))

In [45]:
ps

0     red
1    blue
2     red
dtype: object

In [48]:
ps.str.contains('e')

0    True
1    True
2    True
dtype: bool

In [49]:
df=     eggs  salt
jan    47  12.0
feb   110  50.0
mar   221  89.0

SyntaxError: invalid syntax (<ipython-input-49-4d28c53eeded>, line 1)

In [57]:
p=pd.Series([1,2,3])

In [58]:
p.apply(lambda x: pd.Series([x,x]))

   0  1
0  1  1
1  2  2
2  3  3

In [60]:
x=p.map(lambda x: pd.Series([x,x]))

In [61]:
x

0    0    1
1    1
dtype: int64
1    0    2
1    2
dtype: int64
2    0    3
1    3
dtype: int64
dtype: object

In [62]:
type(x)

pandas.core.series.Series

In [72]:
x[0]

0    1
1    1
dtype: int64

In [73]:
x[0][0]

1